[Reference](https://medium.com/@tubelwj/four-common-methods-to-convert-a-dataframe-into-a-list-in-pandas-77763e29a8cf)

# Sample Data Creation

In [1]:
import pandas as pd
data = {'Name': ['Tiffany', 'Marsha', 'William', 'John', 'Novee'],
        'Age': [15, 30, 25, 22, 31]}
df = pd.DataFrame(data)
print(df)

      Name  Age
0  Tiffany   15
1   Marsha   30
2  William   25
3     John   22
4    Novee   31

# 1) Using the `values` attribute and the `tolist()` method

In [2]:
df_list = df.values.tolist()
print(df_list)
print(type(df_list))

[['Tiffany', 15], ['Marsha', 30], ['William', 25], ['John', 22], ['Novee', 31]]
<class 'list'>

# 2) Using the `to_numpy()` method and the `tolist()` method

In [3]:
df_list = df.to_numpy().tolist()
print(df_list)
print(type(df_list))

[['Tiffany', 15], ['Marsha', 30], ['William', 25], ['John', 22], ['Novee', 31]]
<class 'list'>

# 3) Using the `to_records()` method and the `tolist()` method

In [4]:
df_list = df.to_records().tolist()
print(df_list)
print(type(df_list))

[(0, 'Tiffany', 15), (1, 'Marsha', 30), (2, 'William', 25), (3, 'John', 22), (4, 'Novee', 31)]
<class 'list'>

# 4) Using the `apply()` method and a lambda expression

In [5]:
name_list = df['Name'].apply(lambda x: x).tolist()
print(name_list)

['Tiffany', 'Marsha', 'William', 'John', 'Novee']